// HTML містить розмітку форми.Напиши скрипт, який буде зберігати значення полів у 
// локальне сховище, коли користувач щось друкує.

// < class="feedback-form" autocomplete="off">
//  <input type="email" name="email" autofocus />
//  <textarea name="message" rows="8"></textarea>
//  <button type="submit">Submit</button>

//   1) Відстежуй на формі подію input, і щоразу записуй у локальне сховище об'єкт з полями 
// email і message, у яких зберігай поточні значення полів форми.Нехай ключем для сховища 
// буде рядок "feedback-form-state".
// 2) Під час завантаження сторінки перевіряй стан сховища, і якщо там є збережені дані,
//   заповнюй ними поля форми.В іншому випадку поля повинні бути порожніми.
// 3) Під час сабміту форми очищуй сховище і поля форми, а також виводь у консоль об'єкт з 
// полями email, message та їхніми поточними значеннями.
// 4) Зроби так, щоб сховище оновлювалось не частіше, ніж раз на 500 мілісекунд. 
// Для цього додай до проекту і використовуй бібліотеку lodash.throttle.

//  перевіряти всі значення, які ви читаєте з localStorage і 
// записуєте в поля форми.Якщо там пусто, вам у поля запишеться undefined.При сабміті форми
//  не забувайте чистити обʼєкт в якому зберігаєте значення з полів форми, щоб інформація не 
//  тягнулась в наступні сабміти.Форма має відправлятись при заповнених 2 - х полях форми

const refs = {
  formEl: document.querySelector('.feedback-form'),
  textareaEl : document.querySelector('.feedback-form textarea'),
}
  
console.log(ra);
